### portpg: stocks
### stock:  price

### Restart & Run All Cells

In [3]:
import pandas as pd
import os 
from datetime import date, timedelta
from sqlalchemy import create_engine, text

engine1 = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine1.connect()

engine2 = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine2.connect()

pd.set_option('display.float_format','{:,.2f}'.format)

data_path = os.path.join(os.path.expanduser("~"), "OneDrive","A5","Data")
csv_path = os.path.join(os.path.expanduser("~"), "iCloudDrive")
one_path = os.path.join(os.path.expanduser("~"), "OneDrive","Documents","Data")
osd_path = os.path.join(os.path.expanduser("~"),"OneDrive","Documents","obsidian-git-sync","Data")
dts_path = os.path.join(os.path.expanduser("~"),"Downloads","Datasets")

today = date.today()
week_str = today.strftime('%Y-%U')
today, week_str

(datetime.date(2025, 1, 19), '2025-03')

In [4]:
sql = '''
SELECT name, market
FROM stocks
'''
stocks_lite = pd.read_sql(sql, conlite)
stocks_lite

       name  market
0        AH     SET
1    AIMIRT     SET
2       ASK     SET
3       ASP     SET
4       AWC   SET50
5       BCH  SET100
6   CPNREIT     SET
7       DIF     SET
8    GVREIT     SET
9       IVL   SET50
10    3BBIF     SET
11    JMART   SET50
12      JMT   SET50
13      KCE  SET100
14      MCS     SET
15      NER     SET
16      ORI  SET100
17      PTG  SET100
18    PTTGC   SET50
19      RCL  SET100
20      SCC   SET50
21     SENA     SET
22   SINGER  SET100
23      STA  SET100
24    SYNEX     SET
25    TFFIF     SET
26      TMT     SET
27    WHAIR     SET
28      TOA     SET
29    WHART     SET
30      TVO     SET

In [5]:
sql = '''
SELECT name, market, id
FROM stocks
'''
stocks_pg = pd.read_sql(sql, conpg)
stocks_pg

      name              market   id
0    CPTGF             SET      772
1      AIT            sSET      724
2     ESSO          SET100      787
3      LPF             SET      833
4    CPAXT             SET      839
..     ...                 ...  ...
221  WHAIR             SET      802
222  WHART             SET      945
223  WHAUP  sSET / SETTHSI      946
224   WICE            sSET      947
225   WORK            sSET      948

[226 rows x 3 columns]

In [6]:
df_merge = pd.merge(stocks_lite, stocks_pg, on='name', how='inner')
df_merge

       name market_x                               market_y   id
0        AH      SET                     sSET / SETTHSI      721
1    AIMIRT      SET                                SET      723
2       ASK      SET                                SET      732
3       ASP      SET                               sSET      733
4       AWC    SET50                    SET50 / SETTHSI      735
5       BCH   SET100   SET100 / SETCLMV / SETHD / SETWB      741
6   CPNREIT      SET                                SET      771
7       DIF      SET                                SET      777
8    GVREIT      SET                                SET      798
9       IVL    SET50                    SET50 / SETTHSI      813
10    3BBIF      SET                                SET      814
11    JMART    SET50                              SET50      815
12      JMT    SET50                              SET50      816
13      KCE   SET100                             SET100      819
14      MCS      SET                               sSET      842
15      NER      SET                     sSET / SETTHSI      847
16      ORI   SET100           SET100 / SETHD / SETTHSI      851
17      PTG   SET100                   SET100 / SETTHSI      862
18    PTTGC    SET50          SET50 / SETCLMV / SETTHSI      866
19      RCL   SET100           SET100 / SETCLMV / SETWB      870
20      SCC    SET50  SET50 / SETCLMV / SETHD / SETTHSI      879
21     SENA      SET                               sSET      882
22   SINGER   SET100                     SET100 / SETWB      885
23      STA   SET100           SET100 / SETTHSI / SETWB      898
24    SYNEX      SET                     sSET / SETTHSI      906
25    TFFIF      SET                                SET      909
26      TMT      SET                     sSET / SETTHSI      921
27    WHAIR      SET                                SET      802
28      TOA      SET                            SETTHSI      923
29    WHART      SET                                SET      945
30      TVO      SET                    SETTHSI / SETWB      938

In [7]:
set50 = df_merge.market_y.str.contains('SET50')
filter_50 = df_merge[set50].copy()
filter_50['market_x'] = 'SET50'
filter_50.sort_values(by=['name'],ascending=[True])

     name market_x                               market_y   id
4     AWC    SET50                    SET50 / SETTHSI      735
9     IVL    SET50                    SET50 / SETTHSI      813
11  JMART    SET50                              SET50      815
12    JMT    SET50                              SET50      816
18  PTTGC    SET50          SET50 / SETCLMV / SETTHSI      866
20    SCC    SET50  SET50 / SETCLMV / SETHD / SETTHSI      879

In [8]:
set100 = df_merge.market_y.str.contains('SET100')
filter_100 = df_merge[set100].copy()
filter_100['market_x'] = 'SET100'
filter_100.sort_values(by=['name'],ascending=[True])

      name market_x                              market_y   id
5      BCH   SET100  SET100 / SETCLMV / SETHD / SETWB      741
13     KCE   SET100                            SET100      819
16     ORI   SET100          SET100 / SETHD / SETTHSI      851
17     PTG   SET100                  SET100 / SETTHSI      862
19     RCL   SET100          SET100 / SETCLMV / SETWB      870
22  SINGER   SET100                    SET100 / SETWB      885
23     STA   SET100          SET100 / SETTHSI / SETWB      898

In [9]:
setmai = df_merge.market_y.str.contains('mai')
filter_mai = df_merge[setmai].copy()
filter_mai['market_x'] = 'mai'
filter_mai.sort_values(by=['name'],ascending=[True])

Empty DataFrame
Columns: [name, market_x, market_y, id]
Index: []

In [10]:
filter_set = df_merge[~(set100 | set50 | setmai)].copy()
filter_set['market_x'] = 'SET'
filter_set.sort_values(by=['name'],ascending=[True])

       name market_x             market_y   id
10    3BBIF      SET              SET      814
0        AH      SET   sSET / SETTHSI      721
1    AIMIRT      SET              SET      723
2       ASK      SET              SET      732
3       ASP      SET             sSET      733
6   CPNREIT      SET              SET      771
7       DIF      SET              SET      777
8    GVREIT      SET              SET      798
14      MCS      SET             sSET      842
15      NER      SET   sSET / SETTHSI      847
21     SENA      SET             sSET      882
24    SYNEX      SET   sSET / SETTHSI      906
25    TFFIF      SET              SET      909
26      TMT      SET   sSET / SETTHSI      921
28      TOA      SET          SETTHSI      923
30      TVO      SET  SETTHSI / SETWB      938
27    WHAIR      SET              SET      802
29    WHART      SET              SET      945

In [11]:
filter_all = pd.concat([filter_50, filter_100, filter_mai, filter_set], axis=0)
type(filter_all)

pandas.core.frame.DataFrame

In [12]:
filter_all.to_sql('filter_all', engine1, if_exists='replace')

31

In [13]:
sql = text('''
UPDATE stocks
  SET
    market = (SELECT filter_all.market_x FROM filter_all WHERE filter_all.name = stocks.name)
''')
rp = conlite.execute(sql)

In [14]:
rp.rowcount

31

In [15]:
conpg.close()
conlite.close()